tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "bazelisk"
brew "boost"
brew "bottom"
brew "catch2"
brew "openssl@3"
brew "sqlite"
brew "llvm"
brew "ccls"
brew "cmake"
brew "cmake-docs"
brew "cmake-lint"
brew "conan"
brew "cowsay"
brew "ctags"
brew "curl"
brew "doxygen"
brew "eza"
brew "fd"
brew "harfbuzz"
brew "tesseract"
brew "ffmpeg"
brew "fmt"
brew "fortune"
brew "fzf"
brew "gdu"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "gource"
brew "htop"
brew "httpie"
brew "lazydocker"
brew "lazygit"
brew "lcov"
brew "libsql"
brew "lld"
brew "lua"
brew "luarocks"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "nlohmann-json"
brew "nmap"
brew "node"
brew "nvm"
brew "pandoc"
brew "parallel"
brew "perl"
brew "pip-tools"
brew "pkgconf"
brew "pngpaste"
brew "pyright"
brew "python@3.10"
brew "python@3.9"
brew "pyvim"
brew "qpdf"
brew "qt@5"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "rustup"
brew "sloccount"
brew "stow"
brew "the_silver_searcher"
brew "thefuck"
brew "tmux"
brew "tracy"
brew "transmission-cli"
brew "tree"
brew "weasyprint"
brew "yarn"
brew "zig"
brew "zlib"
brew "zplug"
cask "calibre"
cask "drawio"
cask "firefox"
cask "font-blex-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monofur-nerd-font"
cask "font-mononoki-nerd-font"
cask "google-chrome"
cask "microsoft-edge"
cask "microsoft-teams"
cask "netnewswire"
cask "ngrok"
cask "protonvpn"
cask "slack"
cask "tor-browser"
cask "transmission"
cask "vlc"
cask "wkhtmltopdf"
cask "zoom"
vscode "adpyke.codesnap"
vscode "asvetliakov.vscode-neovim"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "catppuccin.catppuccin-vsc"
vscode "ccls-project.ccls"
vscode "cschlosser.doxdocgen"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "github.vscode-pull-request-github"
vscode "ibm.output-colorizer"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jprestidge.theme-material-theme"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "tomoki1207.pdf"
vscode "vadimcn.vscode-lldb"
vscode "wallenwang.ccls-plus"
vscode "xaver.clang-format"
