tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "openssl@3"
brew "boost"
brew "catch2"
brew "ccls"
brew "cmake"
brew "cmake-docs"
brew "ctags"
brew "curl"
brew "fzf"
brew "git"
brew "harfbuzz"
brew "htop"
brew "llvm"
brew "lua"
brew "luarocks"
brew "neovim"
brew "ninja"
brew "nmap"
brew "node"
brew "perl"
brew "pip-tools"
brew "pyright"
brew "python@3.10"
brew "python@3.9"
brew "pyvim"
brew "qt@5"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "rustup-init"
brew "tesseract"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "zlib"
cask "drawio"
cask "font-blex-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-monofur-nerd-font"
cask "microsoft-teams"
cask "ngrok"
cask "tor-browser"
cask "webex"
cask "zoom"
vscode "adpyke.codesnap"
vscode "asvetliakov.vscode-neovim"
vscode "BracketPairColorDLW.bracket-pair-color-dlw"
vscode "cschlosser.doxdocgen"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "Equinusocio.vsc-community-material-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "IBM.output-colorizer"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "naumovs.color-highlight"
vscode "PKief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "xaver.clang-format"
