tap "achannarasappa/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "virtuslab/scala-cli"
brew "openssl@3"
brew "ruby"
brew "asciidoctor"
brew "ast-grep"
brew "gettext"
brew "bash"
brew "bazelisk"
brew "boost"
brew "bottom"
brew "catch2"
brew "fmt"
brew "sqlite"
brew "llvm"
brew "ccls"
brew "certifi"
brew "cmake"
brew "cmake-docs"
brew "cmake-lint"
brew "curl"
brew "php"
brew "composer"
brew "conan"
brew "harfbuzz"
brew "openjdk"
brew "coursier"
brew "cowsay"
brew "cpanminus"
brew "ctags"
brew "delve"
brew "dotnet"
brew "doxygen"
brew "elixir"
brew "espeak-ng"
brew "eza"
brew "fd"
brew "sdl2"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fortune"
brew "fzf"
brew "gcovr"
brew "gdu"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "gnupg"
brew "go"
brew "gource"
brew "htop"
brew "httpie"
brew "hunspell"
brew "libheif"
brew "imagemagick"
brew "javacc"
brew "julia"
brew "lazydocker"
brew "lazygit"
brew "lcov"
brew "libsql"
brew "lld"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "luarocks"
brew "wget"
brew "luaver"
brew "node"
brew "markdown-toc"
brew "markdownlint-cli2"
brew "marp-cli"
brew "maven"
brew "mecab"
brew "mecab-ipadic"
brew "nasm"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "nlohmann-json"
brew "nmap"
brew "nuitka"
brew "nvm"
brew "pandoc"
brew "parallel"
brew "perl"
brew "pip-tools"
brew "pipx"
brew "pkgconf"
brew "pngpaste"
brew "prettier"
brew "pyinstaller"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "pyvim"
brew "qpdf"
brew "qt@5"
brew "rbenv"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "rustup"
brew "scala"
brew "sloccount"
brew "sox"
brew "starship"
brew "stow"
brew "tectonic"
brew "the_silver_searcher"
brew "thefuck"
brew "tmux"
brew "tracy"
brew "tree"
brew "weasyprint"
brew "weechat"
brew "yarn"
brew "yazi"
brew "zig"
brew "zlib"
brew "zplug"
brew "virtuslab/scala-cli/scala-cli"
cask "anydesk"
cask "basictex"
cask "calibre"
cask "drawio"
cask "firefox"
cask "font-blex-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monofur-nerd-font"
cask "font-mononoki-nerd-font"
cask "google-chrome"
cask "karabiner-elements"
cask "malwarebytes"
cask "microsoft-edge"
cask "microsoft-teams"
cask "netnewswire"
cask "oracle-jdk-javadoc"
cask "protonvpn"
cask "rectangle"
cask "slack"
cask "thorium"
cask "tor-browser"
cask "vlc"
cask "wezterm"
cask "wkhtmltopdf"
cask "zoom"
cask "zotero"
vscode "adpyke.codesnap"
vscode "asvetliakov.vscode-neovim"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "catppuccin.catppuccin-vsc"
vscode "ccls-project.ccls"
vscode "cschlosser.doxdocgen"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "github.vscode-pull-request-github"
vscode "ibm.output-colorizer"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jprestidge.theme-material-theme"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "tomoki1207.pdf"
vscode "vadimcn.vscode-lldb"
vscode "wallenwang.ccls-plus"
vscode "xaver.clang-format"
